In [1]:
print("lets do it")

lets do it

In [4]:
a=10
b=20
c=a+b
print ("a + b = ", c)

a + b =  30

In [5]:
type(a)

int

In [8]:
a = input("enter first num")
b = input("enter second num")
c = int(a) + int(b)
print ("Addition is = ", c)

enter first num2
enter second num3
Addition is =  5

In [11]:
sq_input = input("enter number to find square root: ")
output = int(sq_input) ** 0.5
output

enter number to find square root: 8

2.8284271247461903

In [16]:
a = input("Enter number : ")
if int(a)%2 == 0:
    print (a , "is even")
else:
    print (a,"is odd")

Enter number : 3
3 is odd

In [22]:
for i in range(2,10,3):
    print(i)

2
5
8

In [30]:
#find prime number
num=int(input("Enter Number : "))
for i in range(2,num):
    if num%i == 0:
        print(num, "is not a prime number and can be divided by ", i)
        break
else:
    print(num, "is a prime number")

Enter Number : 10
10 is not a prime number and can be divided by  2
10 is a prime number

In [35]:
#fibonacci number
n1=0
n2=1
nth=int(input("Enter nth Term for Fibonacci numbers"))
if nth <=0:
    print("Entered number should be greater than 0")
elif nth == 1:
    print("Fibonacci Numbers are", n1)
else:
    print("Fibonacci Numbers are")
    a=[n1,n2]
    cnt=2
    while(cnt<=nth):
        a.append(a[cnt-1]+a[cnt-2])
        cnt = cnt +1
    print(a)

Enter nth Term for Fibonacci numbers9
Fibonacci Numbers are
[0, 1, 1, 2, 3, 5, 8, 13, 21, 34]

In [10]:
numbers= [x for x in range(2,9) if x>5]
print(numbers)

[6, 7, 8]

In [ ]:
#pandas panel data

In [45]:
import pandas as pd

In [3]:
s1 = pd.Series([1,2,3,4,5])
print(s1)
type(s1)

0    1
1    2
2    3
3    4
4    5
dtype: int64

pandas.core.series.Series

In [4]:
s1 = pd.Series([1,2,3,4,5],index=['a','b','c','e','f'])
print(s1)
type(s1)

a    1
b    2
c    3
e    4
f    5
dtype: int64

pandas.core.series.Series

In [24]:
s1 = pd.Series({"A":"a","B":"b","C":"c","D":"d","E":"e"})
print(s1)

A    a
B    b
C    c
D    d
E    e
dtype: object

In [11]:
print(s1[:3])

A    a
B    b
C    c
dtype: object

In [26]:
print(s1[-2:])

D    d
E    e
dtype: object

In [27]:
s1

A    a
B    b
C    c
D    d
E    e
dtype: object

In [30]:
print(s1["A"])

a

In [31]:
s1 + "k"

A    ak
B    bk
C    ck
D    dk
E    ek
dtype: object

In [35]:
s2=pd.Series([1,2,3,4,5])
s3=pd.Series([6,7,8,9,10])

In [36]:
s2 + s3

0     7
1     9
2    11
3    13
4    15
dtype: int64

In [38]:
#data frame 2 diamentional labelled array
d1=pd.DataFrame({"Name":["Apeksha","Anaya","Mahendra"],"Age":[31,3,35]})

In [40]:
d1["Name"]

0     Apeksha
1       Anaya
2    Mahendra
Name: Name, dtype: object

In [42]:
type(d1)

pandas.core.frame.DataFrame

In [65]:
f1=pd.read_csv("test.csv")
f1

       Name  age
0   apeksha   30
1     anaya    3
2  mahendra   35
3    shital   28
4     vilas   26

In [60]:
pd.read_csv(filepath_or_buffer = "test.csv")

      Name  age
0  apeksha   30
1    anaya    3

In [66]:
f1.head()

       Name  age
0   apeksha   30
1     anaya    3
2  mahendra   35
3    shital   28
4     vilas   26

In [67]:
f1.tail()

       Name  age
0   apeksha   30
1     anaya    3
2  mahendra   35
3    shital   28
4     vilas   26

In [69]:
f1.shape

(5, 2)

In [70]:
f1.describe()

             age
count   5.000000
mean   24.400000
std    12.421755
min     3.000000
25%    26.000000
50%    28.000000
75%    30.000000
max    35.000000

In [75]:
f1.iloc[0:3,0:2]

       Name  age
0   apeksha   30
1     anaya    3
2  mahendra   35

In [76]:
f1.loc[2:4,("age")]

2    35
3    28
4    26
Name: age, dtype: int64

In [77]:
f1.head()

       Name  age
0   apeksha   30
1     anaya    3
2  mahendra   35
3    shital   28
4     vilas   26

In [82]:
f1.drop([1,2],axis=0)

      Name  age
0  apeksha   30
3   shital   28
4    vilas   26

In [83]:
f1.drop("age",axis=1)

       Name
0   apeksha
1     anaya
2  mahendra
3    shital
4     vilas

In [84]:
f1

       Name  age
0   apeksha   30
1     anaya    3
2  mahendra   35
3    shital   28
4     vilas   26

In [85]:
f1.mean()

age    24.4
dtype: float64

In [86]:
f1.max()

Name    vilas
age        35
dtype: object

In [87]:
f1.min()

Name    anaya
age         3
dtype: object

In [88]:
def double_val(s):
    return s*2

In [90]:
f1["age"].apply(double_val)

0    60
1     6
2    70
3    56
4    52
Name: age, dtype: int64

In [91]:
f1

       Name  age
0   apeksha   30
1     anaya    3
2  mahendra   35
3    shital   28
4     vilas   26

In [93]:
f1["Name"].value_counts()

anaya       1
mahendra    1
apeksha     1
vilas       1
shital      1
Name: Name, dtype: int64

In [94]:
f1.sort_values(by='age')

       Name  age
1     anaya    3
4     vilas   26
3    shital   28
0   apeksha   30
2  mahendra   35